1s/ERP/Conf/Documents/Лико_ЗаявкаНаИзготовлениеФорм.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>Лико_ЗаявкаНаИзготовлениеФорм</Name>
			<BasedOn>
				<xr:Item>Catalog.Лико_Формы</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.Лико_ИсторияДвиженийФорм</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Полимер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЯССМ_ОбъектыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДлинаПолимера</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШиринаПолимера</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоЛистов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИзготовленияПлан</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИзготовленияФакт</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Лико_ВидыОперацийИзготвленияФорм</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерЗаказа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>7</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаказКлиента</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказКлиента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяФайла</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТолщинаПластины</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Растр</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отправлена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Партнер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Формы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Форма</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Лико_Формы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Длина</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ширина</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НоваяФорма</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПричинаПеределки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

1s/ERP/Conf/Enums/Лико_ВидыПечати.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>Лико_ВидыПечати</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Флексо</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Инкджет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Офсет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Глубокая</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Бессольвент</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Траф</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Цифровая</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

1s/ERP/Conf/Catalogs/Лико_Формы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Лико_Формы</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказКлиента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПечати</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Лико_ВидыПечати</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЦветаУдалить</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Лико_ТипыЦвета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипКраски</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЦеновыеГруппы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Название</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Лико_Пантоны</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормаСписана</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УголПоворотаРастра</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Лико_УглыПоворотаРастра</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РабочийЦентр</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РабочиеЦентры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаказПоРельсе</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказКлиента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТрафаретнаяСетка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Лико_ТрафаретныеСетки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПолимера</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Лико_ВидыПолимеров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидСекции</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Лико_ВидыСекций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пересвет</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЦвета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Лико_ТипыЦвета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаказТех</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказКлиента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Грамматура</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцентЗаливки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДистортФлексо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Лико_ДистортыФлексо</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШагПечати</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Площадка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Лико_Площадки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодЛинкс</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сплошная</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ширина</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Длина</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТолщинаПолимера</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДействияСФормой</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Лико_ДействияСФормой</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Этикетки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

1s/ERP/Conf/Documents/Лико_ЗаявкаНаИзготовлениеФорм/Forms/ФормаДокументаУпр/Ext/Form/Module.bsl
#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если Объект.Проведен ТОгда
		ТолькоПросмотр=Истина;
	КонецЕсли;
	
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	
	ЗаполнитьТаблицуФормДополнительнымиПолями();
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	
	ЗаполнитьТаблицуФормДополнительнымиПолями();
	
	
КонецПроцедуры




#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы


&НаКлиенте
Процедура ФормыПриИзменении(Элемент)
	ЗаполнитьТаблицуФормДополнительнымиПолями();
КонецПроцедуры


#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПровестиДокумент(Команда)
	
	ОбщегоНазначенияУТКлиент.Провести(ЭтаФорма, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ПровестиИЗакрыть(Команда)
	
	ОбщегоНазначенияУТКлиент.ПровестиИЗакрыть(ЭтаФорма);
	
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьДокумент(Команда)
	
	ОбщегоНазначенияУТКлиент.Записать(ЭтаФорма, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодборФорм(Команда)
	Структура = Новый Структура;
	Структура.Вставить("ЗаявкаНаИзготовлениеФорм",Истина);
	Структура.Вставить("ВидПечати",ПредопределенноеЗначение("Перечисление.Лико_ВидыПечати.Флексо"));
	Структура.Вставить("Организация",ПолучитьЗначениеДопРеквизитаСервер(Объект.Ответственный,"ОрганизацияПродавец"));
	ОписаниеОповещения= Новый ОписаниеОповещения("ПодборФормЗавершение",ЭтаФорма);
	ОткрытьФорму("Справочник.Лико_Формы.Форма.ФормаПодбораТз",Структура,,,,,ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
КонецПроцедуры



#КонецОбласти

#Область СлужебныеПроцедурыИФункции


&НаСервере
Процедура ЗаполнитьТаблицуФормДополнительнымиПолями() //+Лико m.shenderov 14/11/2019
	
	Для каждого Форма Из Объект.Формы Цикл
		Форма.ВидПолимера			=Форма.Форма.ВидПолимера;
		Форма.УголПоворотаРастра	=Форма.Форма.УголПоворотаРастра; 
		
		Форма.КоличествоМ2 = Форма.Длина/1000 * Форма.Ширина/1000;
		
		
	КонецЦикла;
	
КонецПроцедуры  //-Лико m.shenderov 14/11/2019


&НаКлиенте
Процедура ПодборФормЗавершение(РезультатФормы,ПараметрыФормы) Экспорт  
	Если ТипЗнч(РезультатФормы)=Тип("Структура") Тогда
		РазмерПолимера=ОпределениеРазмераПолимера();
		Для каждого Форма Из РезультатФормы.Массив Цикл
			Если Объект.Формы.НайтиСтроки(Новый Структура("Форма",Форма)).количество()=0 Тогда
				НоваяФорма=Объект.Формы.Добавить();
				НоваяФорма.Форма=Форма;
				НоваяФорма.Длина=РазмерПолимера.Длина;
				НоваяФорма.Ширина=РазмерПолимера.Ширина;
				
				
			КонецЕсли;
			
			
			
		КонецЦикла;
		ЗаполнитьТаблицуФормДополнительнымиПолями();
		
	КонецЕсли;
	
КонецПроцедуры 

Функция ОпределениеРазмераПолимера() //+Лико m.shenderov 12/01/2020
	Возврат 	Документы.Лико_ЗаявкаНаИзготовлениеФорм.ОпределениеРазмераПолимера(Объект.ЗаказКлиента);	
КонецФункции //-Лико m.shenderov 12/01/2020 


&НаСервере
Функция ПолучитьЗначениеДопРеквизитаСервер(ОбъектСсылка,ИмяСвойства) //+Лико m.shenderov 15/11/2019  
	Возврат УправлениеСвойствами.ЗначениеСвойства(ОбъектСсылка,ИмяСвойства);	
КонецФункции  //-Лико m.shenderov 15/11/2019



//СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры


// Конец СтандартныеПодсистемы.ПодключаемыеКоманды


&НаСервере
Процедура ФормыВидПолимераПриИзмененииНаСервере(СтрФорма,ВидПолимера)
	Для каждого Форма Из Объект.Формы Цикл
		СпрОбъект				=Форма.Форма.ПолучитьОбъект();
	//СпрОбъект				=Справочники.Лико_Формы.СоздатьЭлемент();
	СпрОбъект.ВидПолимера	=ВидПолимера;
	СпрОбъект.Записать();

		
	КонецЦикла;
		// Insert handler content.
КонецПроцедуры

&НаКлиенте
Процедура ФормыВидПолимераПриИзменении(Элемент)
	Форма=Элементы.Формы.ТекущиеДанные;
	Если ЗначениеЗаполнено(Форма.Форма) Тогда
		ФормыВидПолимераПриИзмененииНаСервере(Форма.Форма,Форма.ВидПолимера);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ФормыУголПоворотаРастраПриИзмененииНаСервере(Форма,УголПоворота)
	СпрОбъект				=Форма.ПолучитьОбъект();
	//СпрОбъект				=Справочники.Лико_Формы.СоздатьЭлемент();
	СпрОбъект.УголПоворотаРастра	=УголПоворота;
	СпрОбъект.Записать();
	
КонецПроцедуры

&НаКлиенте
Процедура ФормыУголПоворотаРастраПриИзменении(Элемент)
	Форма=Элементы.Формы.ТекущиеДанные;
	Если ЗначениеЗаполнено(Форма.Форма) Тогда
		ФормыУголПоворотаРастраПриИзмененииНаСервере(Форма.Форма,Форма.УголПоворотаРастра);
	КонецЕсли;
	
	
КонецПроцедуры

&НаКлиенте
Процедура ФормыПричинаПеределкиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка=Ложь;
	ОткрытьФорму("Справочник.ЛК_ПричиныИзмененияФорм.ФормаВыбора",,Элемент,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура ФормыПричинаПеределкиОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если ПараметрыЗаписи.РежимЗаписи=РежимЗаписиДокумента.Проведение Тогда
		Для каждого СтрФорма Из Объект.Формы Цикл
			
			Если Не СтрФорма.НоваяФорма и НЕ ЗначениеЗаполнено(СтрФорма.ПричинаПеределки) Тогда
				НомерСтроки=Строка(Объект.Формы.Индекс(СтрФорма));	
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = "Не указана причина переделки № "+ СтрФорма.номерстроки;
				Сообщение.Поле = "Объект.Формы["+НомерСтроки+"].ПричинаПеределки"; //имя реквизита 
				Сообщение.УстановитьДанные(Объект); //Ссылка на объект ИБ
				Сообщение.Сообщить(); 
				Отказ=Истина;
			КонецЕсли;
			
			//	Если НЕ ЗначениеЗаполнено(Лико_Дополнительно.ЗначениеРеквизитаОбъекта(СтрФорма.Форма,"Заказ")) Тогда
			//	НомерСтроки=Строка(Объект.Формы.Индекс(СтрФорма));	
			//	Сообщение = Новый СообщениеПользователю;
			//	Сообщение.Текст = " не указан заказ в форме № "+ СтрФорма.номерстроки;
			//	Сообщение.Поле = "Объект.Формы["+НомерСтроки+"].Форма"; //имя реквизита 
			//	Сообщение.УстановитьДанные(Объект); //Ссылка на объект ИБ
			//	Сообщение.Сообщить(); 
			//	Отказ=Истина;
			//КонецЕсли;
			
			
			
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗаказПриИзменении(Элемент)
	Если Объект.Организация=ПолучитьОрганизациуЭкофлексСервер() Тогда
		Возврат;
	КонецЕсли;

	ЗаполнитьПоЗаказу();
	ЗаполнитьТаблицуФормДополнительнымиПолями();
	
КонецПроцедуры


Функция ПолучитьОрганизациуЭкофлексСервер()

	Возврат Справочники.Лико_ПредопределенныеЗначения.ОрганизацияЭкоФлекс.ЗначениеПараметра;

КонецФункции // ПолучитьОрганизациуЭкофлексСервер()


Процедура ЗаполнитьПоЗаказу()
	Объект.Формы.Очистить();
	Заказ=Объект.ЗаказКлиента;
	Объект.ИмяФайла = Заказ.ИмяФайла;
	Объект.Партнер=Заказ.Партнер;
	Объект.Контрагент = Заказ.Контрагент;
	Объект.Ответственный = ПараметрыСеанса.ТекущийПользователь;
	Объект.Растр = Заказ.Растр;
	
	Если Заказ.Площадка= Справочники.Лико_Площадки.Сибирь Тогда
		
		//Объект.Контрагент=Справочники.Контрагенты.НайтиПоНаименованию("ФлексоЦентр ПАРТНЁР ООО");
		Объект.Контрагент=Справочники.Лико_ПредопределенныеЗначения.ПоставщикФормЭкофлекс.ЗначениеПараметра;
		
		Объект.Партнер=Объект.Контрагент.Партнер;
	КонецЕсли;
	РазмерПолимера=Документы.Лико_ЗаявкаНаИзготовлениеФорм.ОпределениеРазмераПолимера(Заказ);
	Объект.ТолщинаПластины = Заказ.ТолщинаПластины;
	Для Каждого ТекСтрокаЦвета Из Заказ.Цвета Цикл
		Если ЗначениеЗаполнено(ТекСтрокаЦвета.Форма) и ТекСтрокаЦвета.Цветоделение и 
			ТекСтрокаЦвета.Форма.ВидПечати=Перечисления.Лико_ВидыПечати.Флексо Тогда
			
			НоваяСтрока = Объект.Формы.Добавить();
			НоваяСтрока.Форма = ТекСтрокаЦвета.Форма;
			НоваяСтрока.НоваяФорма=Истина;
			НоваяСтрока.Длина=РазмерПолимера.Длина;
			НоваяСтрока.Ширина=РазмерПолимера.Ширина;
			
			Если Не ЗначениеЗаполнено(НоваяСтрока.Форма .УголПоворотаРастра) и
				Заказ.Площадка= Справочники.Лико_Площадки.Сибирь Тогда
				
				Документы.Лико_ЗаявкаНаИзготовлениеФорм.ЗаписатьУголПоворотаРастра(НоваяСтрока.Форма);
				
			КонецЕсли;
			
		КонецЕсли;
	КонецЦикла;
	
	//}}__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
КонецПроцедуры

&НаСервере
Процедура ПоставщикПриИзмененииНаСервере()
	ПартнерыИКонтрагенты.ЗаполнитьКонтрагентаПартнераПоУмолчанию(Объект.Партнер,Объект.Контрагент );
	
КонецПроцедуры

&НаКлиенте
Процедура ПоставщикПриИзменении(Элемент)
	ПоставщикПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПересчитатьДлинуШиринуНаСервере()	
	РазмерПолимера=ОпределениеРазмераПолимера();
	Для каждого Форма Из Объект.Формы Цикл				
		Форма.Длина		=РазмерПолимера.Длина;
		Форма.Ширина	=РазмерПолимера.Ширина;
	КонецЦикла;
	ЗаполнитьТаблицуФормДополнительнымиПолями();
	
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьДлинуШирину(Команда)
	ОписаниеОповещения = Новый ОписаниеОповещения("ПересчитатьДлиннуШиринуНаСервереЗавершение", ЭтотОбъект);
	ПоказатьВопрос(ОписаниеОповещения, "Пересчитать длину ширину?",РежимДиалогаВопрос.ДаНет, 60);
КонецПроцедуры

&НаКлиенте 
Процедура ПересчитатьДлиннуШиринуНаСервереЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		ПересчитатьДлинуШиринуНаСервере();
		
	КонецЕсли; 
	
КонецПроцедуры



#КонецОбласти
